# __Data Handling and Manipulation.__
Date : 15, May, 2024.

Importing libraries.

In [1]:
import pandas as pd
import numpy as np

Loading the dataset

In [2]:
filename = "sales.csv"
data = pd.read_csv(filename)
data.head()

   rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0   7.0                   NaN                    150                   200
1   8.0                 120.0                    180                   240
2   NaN                  80.0                    120                   160
3   4.0                 150.0                    225                   300
4   5.0                   NaN                    135                   180

Checking Missing Values.

In [3]:
# show number of missing values
data.isnull().sum()

rate                     2
sales_in_first_month     3
sales_in_second_month    0
sales_in_third_month     0
dtype: int64

Checking for the data-type of the columns.

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   rate                   8 non-null      float64
 1   sales_in_first_month   7 non-null      float64
 2   sales_in_second_month  10 non-null     int64
 3   sales_in_third_month   10 non-null     int64
dtypes: float64(2), int64(2)
memory usage: 452.0 bytes

Mean of Columns.

In [5]:
data.mean()

rate                       5.750000
sales_in_first_month     117.857143
sales_in_second_month    164.900000
sales_in_third_month     220.000000
dtype: float64

Handling missing or Nan values.

In [6]:
data['rate'].fillna(0, inplace = True)
data.head()

C:\Users\asus\AppData\Local\Temp\ipykernel_15920\1619445866.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['rate'].fillna(0, inplace = True)

   rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0   7.0                   NaN                    150                   200
1   8.0                 120.0                    180                   240
2   0.0                  80.0                    120                   160
3   4.0                 150.0                    225                   300
4   5.0                   NaN                    135                   180

In [7]:
data['sales_in_first_month'].fillna(118, inplace=True)
data.head()

C:\Users\asus\AppData\Local\Temp\ipykernel_15920\1402508458.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['sales_in_first_month'].fillna(118, inplace=True)

   rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0   7.0                 118.0                    150                   200
1   8.0                 120.0                    180                   240
2   0.0                  80.0                    120                   160
3   4.0                 150.0                    225                   300
4   5.0                 118.0                    135                   180

Feature Selection

In [11]:
X = data.iloc[:, :3]  # take data from 3rd column  
Y = data.iloc[:, -1]  # select last column

In [12]:
X.head()

   rate  sales_in_first_month  sales_in_second_month
0   7.0                 118.0                    150
1   8.0                 120.0                    180
2   0.0                  80.0                    120
3   4.0                 150.0                    225
4   5.0                 118.0                    135

In [14]:
Y.head()

0    200
1    240
2    160
3    300
4    180
Name: sales_in_third_month, dtype: int64